Masmiseim36/nxpSDK/devices/MIMXRT1187/periph/PERI_NETC_SW_ENETC.h
/*
** ###################################################################
**     Processors:          MIMXRT1181CVP2B
**                          MIMXRT1181CVP2C
**                          MIMXRT1181XVP2B
**                          MIMXRT1181XVP2C
**                          MIMXRT1182CVP2B
**                          MIMXRT1182CVP2C
**                          MIMXRT1182XVP2B
**                          MIMXRT1182XVP2C
**                          MIMXRT1186CVJ8C_cm33
**                          MIMXRT1186CVJ8C_cm7
**                          MIMXRT1186XVJ8C_cm33
**                          MIMXRT1186XVJ8C_cm7
**                          MIMXRT1187AVM8B_cm33
**                          MIMXRT1187AVM8B_cm7
**                          MIMXRT1187AVM8C_cm33
**                          MIMXRT1187AVM8C_cm7
**                          MIMXRT1187CVM8B_cm33
**                          MIMXRT1187CVM8B_cm7
**                          MIMXRT1187CVM8C_cm33
**                          MIMXRT1187CVM8C_cm7
**                          MIMXRT1187XVM8B_cm33
**                          MIMXRT1187XVM8B_cm7
**                          MIMXRT1187XVM8C_cm33
**                          MIMXRT1187XVM8C_cm7
**                          MIMXRT1189CVM8B_cm33
**                          MIMXRT1189CVM8B_cm7
**                          MIMXRT1189CVM8C_cm33
**                          MIMXRT1189CVM8C_cm7
**                          MIMXRT1189XVM8B_cm33
**                          MIMXRT1189XVM8B_cm7
**                          MIMXRT1189XVM8C_cm33
**                          MIMXRT1189XVM8C_cm7
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250611
**
**     Abstract:
**         CMSIS Peripheral Access Layer for NETC_SW_ENETC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2021-03-09)
**         Initial version.
**     - rev. 2.0 (2024-01-18)
**         Header RFP.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_NETC_SW_ENETC.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for NETC_SW_ENETC
 *
 * CMSIS Peripheral Access Layer for NETC_SW_ENETC
 */

#if !defined(PERI_NETC_SW_ENETC_H_)
#define PERI_NETC_SW_ENETC_H_                    /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1181CVP2B) || defined(CPU_MIMXRT1181CVP2C) || defined(CPU_MIMXRT1181XVP2B) || defined(CPU_MIMXRT1181XVP2C))
#include "MIMXRT1181_COMMON.h"
#elif (defined(CPU_MIMXRT1182CVP2B) || defined(CPU_MIMXRT1182CVP2C) || defined(CPU_MIMXRT1182XVP2B) || defined(CPU_MIMXRT1182XVP2C))
#include "MIMXRT1182_COMMON.h"
#elif (defined(CPU_MIMXRT1186CVJ8C_cm33) || defined(CPU_MIMXRT1186XVJ8C_cm33))
#include "MIMXRT1186_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1186CVJ8C_cm7) || defined(CPU_MIMXRT1186XVJ8C_cm7))
#include "MIMXRT1186_cm7_COMMON.h"
#elif (defined(CPU_MIMXRT1187AVM8B_cm33) || defined(CPU_MIMXRT1187AVM8C_cm33) || defined(CPU_MIMXRT1187CVM8B_cm33) || defined(CPU_MIMXRT1187CVM8C_cm33) || defined(CPU_MIMXRT1187XVM8B_cm33) || defined(CPU_MIMXRT1187XVM8C_cm33))
#include "MIMXRT1187_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1187AVM8B_cm7) || defined(CPU_MIMXRT1187AVM8C_cm7) || defined(CPU_MIMXRT1187CVM8B_cm7) || defined(CPU_MIMXRT1187CVM8C_cm7) || defined(CPU_MIMXRT1187XVM8B_cm7) || defined(CPU_MIMXRT1187XVM8C_cm7))
#include "MIMXRT1187_cm7_COMMON.h"
#elif (defined(CPU_MIMXRT1189CVM8B_cm33) || defined(CPU_MIMXRT1189CVM8C_cm33) || defined(CPU_MIMXRT1189XVM8B_cm33) || defined(CPU_MIMXRT1189XVM8C_cm33))
#include "MIMXRT1189_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1189CVM8B_cm7) || defined(CPU_MIMXRT1189CVM8C_cm7) || defined(CPU_MIMXRT1189XVM8B_cm7) || defined(CPU_MIMXRT1189XVM8C_cm7))
#include "MIMXRT1189_cm7_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- NETC_SW_ENETC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_SW_ENETC_Peripheral_Access_Layer NETC_SW_ENETC Peripheral Access Layer
 * @{
 */

/** NETC_SW_ENETC - Size of Registers Arrays */
#define NETC_SW_ENETC_NUM_PROFILE_COUNT           2u

/** NETC_SW_ENETC - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4096];
  __I  uint32_t IPCAPR;                            /**< Ingress port capability register, offset: 0x1000 */
  __I  uint32_t EPCAPR;                            /**< Egress port capability register, offset: 0x1004 */
       uint8_t RESERVED_1[8];
  __I  uint32_t OSR;                               /**< Operational state register, offset: 0x1010 */
       uint8_t RESERVED_2[44];
  __IO uint32_t CMECR;                             /**< Correctable memory error configuration register, offset: 0x1040 */
  __IO uint32_t CMESR;                             /**< Correctable memory error status register, offset: 0x1044 */
       uint8_t RESERVED_3[4];
  __I  uint32_t CMECTR;                            /**< Correctable memory error count register, offset: 0x104C */
       uint8_t RESERVED_4[16];
  __IO uint32_t UNMACECR;                          /**< Uncorrectable non-fatal MAC error configuration register, offset: 0x1060 */
  __I  uint32_t UNMACESR;                          /**< Uncorrectable non-fatal MAC error status register, offset: 0x1064 */
       uint8_t RESERVED_5[8];
  __IO uint32_t UNSBECR;                           /**< Uncorrectable non-fatal system bus error configuration register, offset: 0x1070, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t UNSBESR;                           /**< Uncorrectable non-fatal system bus error status register, offset: 0x1074, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_6[4];
  __I  uint32_t UNSBECTR;                          /**< Uncorrectable non-fatal system bus error count register, offset: 0x107C, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t UFSBECR;                           /**< Uncorrectable fatal system bus error configuration register, offset: 0x1080, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t UFSBESR;                           /**< Uncorrectable fatal system bus error status register, offset: 0x1084, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_7[8];
  __IO uint32_t UNMECR;                            /**< Uncorrectable non-fatal memory error configuration register, offset: 0x1090 */
  __IO uint32_t UNMESR0;                           /**< Uncorrectable non-fatal memory error status register 0, offset: 0x1094 */
  __I  uint32_t UNMESR1;                           /**< Uncorrectable non-fatal memory error status register 1, offset: 0x1098 */
  __I  uint32_t UNMECTR;                           /**< Uncorrectable non-fatal memory error count register, offset: 0x109C */
  __IO uint32_t UFMECR;                            /**< Uncorrectable fatal memory error configuration register, offset: 0x10A0 */
  __IO uint32_t UFMESR0;                           /**< Uncorrectable fatal memory error status register 0, offset: 0x10A4 */
  __I  uint32_t UFMESR1;                           /**< Uncorrectable fatal memory error status register 1, offset: 0x10A8 */
       uint8_t RESERVED_8[52];
  __I  uint32_t IMDIOIRR;                          /**< Internal MDIO interrupt reason register, offset: 0x10E0, available only on: ENETC0_COMMON, SW0_COMMON (missing on ENETC1_COMMON) */
  __IO uint32_t IMDIOMSIVR;                        /**< Internal MDIO MSI-X vector register, offset: 0x10E4, available only on: ENETC0_COMMON, SW0_COMMON (missing on ENETC1_COMMON) */
  __I  uint32_t EMDIOIRR;                          /**< External MDIO interrupt reason register, offset: 0x10E8, available only on: ENETC0_COMMON, SW0_COMMON (missing on ENETC1_COMMON) */
  __IO uint32_t EMDIOMSIVR;                        /**< External MDIO MSI-X vector register, offset: 0x10EC, available only on: ENETC0_COMMON, SW0_COMMON (missing on ENETC1_COMMON) */
       uint8_t RESERVED_9[16];
  __IO uint32_t TCCR;                              /**< Time capture configuration register, offset: 0x1100, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t TCIER;                             /**< Time capture interrupt enable register, offset: 0x1104, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t TCRPIDR;                           /**< Time capture receive port interrupt detect register, offset: 0x1108, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t TCRPSR;                            /**< Time capture receive port status register, offset: 0x110C, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_10[4];
  __I  uint32_t TCRPTSR;                           /**< Time capture receive port timestamp register, offset: 0x1114, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t TCMSIVR;                           /**< Time capture MSI-X vector register, offset: 0x1118, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_11[228];
  __IO uint32_t CVLANR1;                           /**< Custom VLAN EtherType register 1, offset: 0x1200 */
  __IO uint32_t CVLANR2;                           /**< Custom VLAN EtherType register 2, offset: 0x1204 */
  __IO uint32_t PSRTAGETR;                         /**< Pre-Standard RTAG EtherType register, offset: 0x1208, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_12[20];
  __IO uint32_t DOSL2CR;                           /**< DoS L2 configuration register, offset: 0x1220 */
       uint8_t RESERVED_13[220];
  struct {                                         /* offset: 0x1300, array step: 0x10 */
    __IO uint32_t VLANIPVMPR0;                       /**< VLAN to IPV mapping profile 0 register 0..VLAN to IPV mapping profile 1 register 0, array offset: 0x1300, array step: 0x10, irregular array, not all indices are valid */
    __IO uint32_t VLANIPVMPR1;                       /**< VLAN to IPV mapping profile 0 register 1..VLAN to IPV mapping profile 1 register 1, array offset: 0x1304, array step: 0x10, irregular array, not all indices are valid */
    __IO uint32_t VLANDRMPR;                         /**< VLAN to DR mapping profile 0 register..VLAN to DR mapping profile 1 register, array offset: 0x1308, array step: 0x10, irregular array, not all indices are valid */
         uint8_t RESERVED_0[4];
  } NUM_PROFILE[NETC_SW_ENETC_NUM_PROFILE_COUNT];
       uint8_t RESERVED_14[800];
  __I  uint32_t IPFCAPR;                           /**< Ingress port filter capability register, offset: 0x1640 */
  __I  uint32_t IPFTCAPR;                          /**< Ingress port filter table capability register, offset: 0x1644 */
  __I  uint32_t IPFTMOR;                           /**< Ingress port filter table memory operational register, offset: 0x1648 */
       uint8_t RESERVED_15[436];
  __I  uint32_t ITMCAPR;                           /**< Index table memory capability register, offset: 0x1800 */
       uint8_t RESERVED_16[12];
  __I  uint32_t RPCAPR;                            /**< Rate policer capability register, offset: 0x1810 */
  __I  uint32_t RPITCAPR;                          /**< Rate policer index table capability register, offset: 0x1814 */
  __IO uint32_t RPITMAR;                           /**< Rate policer index table memory allocation register, offset: 0x1818 */
  __I  uint32_t RPITOR;                            /**< Rate policer index table operational register, offset: 0x181C */
       uint8_t RESERVED_17[4];
  __I  uint32_t ISCITCAPR;                         /**< Ingress stream counter index table capability register, offset: 0x1824 */
  __IO uint32_t ISCITMAR;                          /**< Ingress stream counter index table memory allocation register, offset: 0x1828 */
  __I  uint32_t ISCITOR;                           /**< Ingress stream counter index table operational register, offset: 0x182C */
  __I  uint32_t ISCAPR;                            /**< Ingress stream capability register, offset: 0x1830 */
  __I  uint32_t ISITCAPR;                          /**< Ingress stream index table capability register, offset: 0x1834 */
  __IO uint32_t ISITMAR;                           /**< Ingress stream index table memory allocation register, offset: 0x1838 */
  __I  uint32_t ISITOR;                            /**< Ingress stream index table operational register, offset: 0x183C */
       uint8_t RESERVED_18[4];
  __I  uint32_t ISQGITCAPR;                        /**< Ingress sequence generation index table capability register, offset: 0x1844, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISQGITMAR;                         /**< Ingress sequence generation index table memory allocation register, offset: 0x1848, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t ISQGITOR;                          /**< Ingress sequence generation index table operational register, offset: 0x184C, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_19[16];
  __I  uint32_t SGCAPR;                            /**< Stream gate capability register, offset: 0x1860 */
  __I  uint32_t SGIITCAPR;                         /**< Stream gate instance index table capability register, offset: 0x1864 */
  __IO uint32_t SGIITMAR;                          /**< Stream gate instance index table memory allocation register, offset: 0x1868 */
  __I  uint32_t SGIITOR;                           /**< Stream gate instance index table operational register, offset: 0x186C */
       uint8_t RESERVED_20[4];
  __I  uint32_t SGCLITCAPR;                        /**< Stream gate control list index table capability register, offset: 0x1874 */
  __IO uint32_t SGCLITMAR;                         /**< Stream gate control list index table memory allocation register, offset: 0x1878 */
  __I  uint32_t SGCLTMOR;                          /**< Stream gate control list table memory operational register, offset: 0x187C */
  __I  uint32_t FMICAPR;                           /**< Frame modification ingress capability register, offset: 0x1880, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t FMECAPR;                           /**< Frame modification egress capability register, offset: 0x1884, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t FMITCAPR;                          /**< Frame modification index table capability register, offset: 0x1888, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t FMITMAR;                           /**< Frame modification index table memory allocation register, offset: 0x188C, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t FMITOR;                            /**< Frame modification index table operational register, offset: 0x1890, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t FMDITCAPR;                         /**< Frame modification data index table capability register, offset: 0x1894, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t FMDITMAR;                          /**< Frame modification data index table memory allocation register, offset: 0x1898, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_21[36];
  __I  uint32_t ETCAPR;                            /**< Egress treatment capability register, offset: 0x18C0, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t ETTCAPR;                           /**< Egress treatment table capability register, offset: 0x18C4, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_22[4];
  __I  uint32_t ETTOR;                             /**< Egress treatment table operational register, offset: 0x18CC, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_23[4];
  __I  uint32_t TGSTCAPR;                          /**< Time gate scheduling table capability register, offset: 0x18D4 */
       uint8_t RESERVED_24[4];
  __I  uint32_t TGSTMOR;                           /**< Time gate scheduling table memory operation register, offset: 0x18DC */
  __I  uint32_t ESQRCAPR;                          /**< Egress sequence recovery capability register, offset: 0x18E0, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t ESQRTCAPR;                         /**< Egress sequence recovery table capability register, offset: 0x18E4, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_25[4];
  __I  uint32_t ECTCAPR;                           /**< Egress counter table capability register, offset: 0x18EC, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_26[16];
  __I  uint32_t HTMCAPR;                           /**< Hash table memory capability register, offset: 0x1900 */
  __I  uint32_t HTMOR;                             /**< Hash table memory operational register, offset: 0x1904 */
       uint8_t RESERVED_27[8];
  __I  uint32_t ISIDCAPR;                          /**< Ingress stream identification capability register, offset: 0x1910 */
  __I  uint32_t ISIDHTCAPR;                        /**< Ingress stream identification hash table capability register, offset: 0x1914 */
       uint8_t RESERVED_28[8];
  __I  uint32_t ISIDKC0OR;                         /**< Ingress stream identification key construction 0 operational register, offset: 0x1920 */
  __IO uint32_t ISIDKC0CR0;                        /**< Ingress stream identification key construction 0 configuration register 0, offset: 0x1924 */
       uint8_t RESERVED_29[8];
  __IO uint32_t ISIDKC0PF0CR;                      /**< Ingress stream identification key construction 0 payload field 0 configuration register, offset: 0x1930 */
  __IO uint32_t ISIDKC0PF1CR;                      /**< Ingress stream identification key construction 0 payload field 1 configuration register, offset: 0x1934 */
  __IO uint32_t ISIDKC0PF2CR;                      /**< Ingress stream identification key construction 0 payload field 2 configuration register, offset: 0x1938 */
  __IO uint32_t ISIDKC0PF3CR;                      /**< Ingress stream identification key construction 0 payload field 3 configuration register, offset: 0x193C */
  __I  uint32_t ISIDKC1OR;                         /**< Ingress stream identification key construction 1 operational register, offset: 0x1940 */
  __IO uint32_t ISIDKC1CR0;                        /**< Ingress stream identification key construction 1 configuration register 0, offset: 0x1944 */
       uint8_t RESERVED_30[8];
  __IO uint32_t ISIDKC1PF0CR;                      /**< Ingress stream identification key construction 1 payload field 0 configuration register, offset: 0x1950 */
  __IO uint32_t ISIDKC1PF1CR;                      /**< Ingress stream identification key construction 1 payload field 1 configuration register, offset: 0x1954 */
  __IO uint32_t ISIDKC1PF2CR;                      /**< Ingress stream identification key construction 1 payload field 2 configuration register, offset: 0x1958 */
  __IO uint32_t ISIDKC1PF3CR;                      /**< Ingress stream identification key construction 1 payload field 3 configuration register, offset: 0x195C */
  __I  uint32_t ISIDKC2OR;                         /**< Ingress stream identification key construction 2 operational register, offset: 0x1960, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC2CR0;                        /**< Ingress stream identification key construction 2 configuration register 0, offset: 0x1964, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_31[8];
  __IO uint32_t ISIDKC2PF0CR;                      /**< Ingress stream identification key construction 2 payload field 0 configuration register, offset: 0x1970, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC2PF1CR;                      /**< Ingress stream identification key construction 2 payload field 1 configuration register, offset: 0x1974, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC2PF2CR;                      /**< Ingress stream identification key construction 2 payload field 2 configuration register, offset: 0x1978, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC2PF3CR;                      /**< Ingress stream identification key construction 2 payload field 3 configuration register, offset: 0x197C, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __I  uint32_t ISIDKC3OR;                         /**< Ingress stream identification key construction 3 operational register, offset: 0x1980, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC3CR0;                        /**< Ingress stream identification key construction 3 configuration register 0, offset: 0x1984, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_32[8];
  __IO uint32_t ISIDKC3PF0CR;                      /**< Ingress stream identification key construction 3 payload field 0 configuration register, offset: 0x1990, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC3PF1CR;                      /**< Ingress stream identification key construction 3 payload field 1 configuration register, offset: 0x1994, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC3PF2CR;                      /**< Ingress stream identification key construction 3 payload field 2 configuration register, offset: 0x1998, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
  __IO uint32_t ISIDKC3PF3CR;                      /**< Ingress stream identification key construction 3 payload field 3 configuration register, offset: 0x199C, available only on: SW0_COMMON (missing on ENETC0_COMMON, ENETC1_COMMON) */
       uint8_t RESERVED_33[96];
  __I  uint32_t ISFHTCAPR;                         /**< Ingress stream filter hash table capability register, offset: 0x1A00 */
