Masmiseim36/nxpSDK/devices/MIMXRT1187/periph/PERI_NETC_SW_ENETC.h
/*! @name TCRPIDR - Time capture receive port interrupt detect register */
/*! @{ */

#define NETC_SW_ENETC_TCRPIDR_TX_PORT0_MASK      (0x1U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT0_SHIFT     (0U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT0(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPIDR_TX_PORT0_SHIFT)) & NETC_SW_ENETC_TCRPIDR_TX_PORT0_MASK)

#define NETC_SW_ENETC_TCRPIDR_TX_PORT1_MASK      (0x2U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT1_SHIFT     (1U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT1(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPIDR_TX_PORT1_SHIFT)) & NETC_SW_ENETC_TCRPIDR_TX_PORT1_MASK)

#define NETC_SW_ENETC_TCRPIDR_TX_PORT2_MASK      (0x4U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT2_SHIFT     (2U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT2(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPIDR_TX_PORT2_SHIFT)) & NETC_SW_ENETC_TCRPIDR_TX_PORT2_MASK)

#define NETC_SW_ENETC_TCRPIDR_TX_PORT3_MASK      (0x8U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT3_SHIFT     (3U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT3(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPIDR_TX_PORT3_SHIFT)) & NETC_SW_ENETC_TCRPIDR_TX_PORT3_MASK)

#define NETC_SW_ENETC_TCRPIDR_TX_PORT4_MASK      (0x10U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT4_SHIFT     (4U)
#define NETC_SW_ENETC_TCRPIDR_TX_PORT4(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPIDR_TX_PORT4_SHIFT)) & NETC_SW_ENETC_TCRPIDR_TX_PORT4_MASK)

#define NETC_SW_ENETC_TCRPIDR_TRANSMIT_MASK      (0x40000000U)
#define NETC_SW_ENETC_TCRPIDR_TRANSMIT_SHIFT     (30U)
/*! TRANSMIT - Transmit interrupt */
#define NETC_SW_ENETC_TCRPIDR_TRANSMIT(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPIDR_TRANSMIT_SHIFT)) & NETC_SW_ENETC_TCRPIDR_TRANSMIT_MASK)

#define NETC_SW_ENETC_TCRPIDR_TIMEOUT_MASK       (0x80000000U)
#define NETC_SW_ENETC_TCRPIDR_TIMEOUT_SHIFT      (31U)
/*! TIMEOUT - Timeout interrupt */
#define NETC_SW_ENETC_TCRPIDR_TIMEOUT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPIDR_TIMEOUT_SHIFT)) & NETC_SW_ENETC_TCRPIDR_TIMEOUT_MASK)
/*! @} */

/*! @name TCRPSR - Time capture receive port status register */
/*! @{ */

#define NETC_SW_ENETC_TCRPSR_RX_PORT_MASK        (0x1FU)
#define NETC_SW_ENETC_TCRPSR_RX_PORT_SHIFT       (0U)
#define NETC_SW_ENETC_TCRPSR_RX_PORT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPSR_RX_PORT_SHIFT)) & NETC_SW_ENETC_TCRPSR_RX_PORT_MASK)

#define NETC_SW_ENETC_TCRPSR_RX_CNT_MASK         (0x300U)
#define NETC_SW_ENETC_TCRPSR_RX_CNT_SHIFT        (8U)
#define NETC_SW_ENETC_TCRPSR_RX_CNT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPSR_RX_CNT_SHIFT)) & NETC_SW_ENETC_TCRPSR_RX_CNT_MASK)
/*! @} */

/*! @name TCRPTSR - Time capture receive port timestamp register */
/*! @{ */

#define NETC_SW_ENETC_TCRPTSR_TIMESTAMP_MASK     (0xFFFFFFFFU)
#define NETC_SW_ENETC_TCRPTSR_TIMESTAMP_SHIFT    (0U)
#define NETC_SW_ENETC_TCRPTSR_TIMESTAMP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCRPTSR_TIMESTAMP_SHIFT)) & NETC_SW_ENETC_TCRPTSR_TIMESTAMP_MASK)
/*! @} */

/*! @name TCMSIVR - Time capture MSI-X vector register */
/*! @{ */

#define NETC_SW_ENETC_TCMSIVR_VECTOR_MASK        (0xFU)
#define NETC_SW_ENETC_TCMSIVR_VECTOR_SHIFT       (0U)
#define NETC_SW_ENETC_TCMSIVR_VECTOR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCMSIVR_VECTOR_SHIFT)) & NETC_SW_ENETC_TCMSIVR_VECTOR_MASK)
/*! @} */

/*! @name CVLANR1 - Custom VLAN EtherType register 1 */
/*! @{ */

#define NETC_SW_ENETC_CVLANR1_ETYPE_MASK         (0xFFFFU)
#define NETC_SW_ENETC_CVLANR1_ETYPE_SHIFT        (0U)
#define NETC_SW_ENETC_CVLANR1_ETYPE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CVLANR1_ETYPE_SHIFT)) & NETC_SW_ENETC_CVLANR1_ETYPE_MASK)

#define NETC_SW_ENETC_CVLANR1_V_MASK             (0x80000000U)
#define NETC_SW_ENETC_CVLANR1_V_SHIFT            (31U)
/*! V - Valid */
#define NETC_SW_ENETC_CVLANR1_V(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CVLANR1_V_SHIFT)) & NETC_SW_ENETC_CVLANR1_V_MASK)
/*! @} */

/*! @name CVLANR2 - Custom VLAN EtherType register 2 */
/*! @{ */

#define NETC_SW_ENETC_CVLANR2_ETYPE_MASK         (0xFFFFU)
#define NETC_SW_ENETC_CVLANR2_ETYPE_SHIFT        (0U)
#define NETC_SW_ENETC_CVLANR2_ETYPE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CVLANR2_ETYPE_SHIFT)) & NETC_SW_ENETC_CVLANR2_ETYPE_MASK)

#define NETC_SW_ENETC_CVLANR2_V_MASK             (0x80000000U)
#define NETC_SW_ENETC_CVLANR2_V_SHIFT            (31U)
/*! V - Valid */
#define NETC_SW_ENETC_CVLANR2_V(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CVLANR2_V_SHIFT)) & NETC_SW_ENETC_CVLANR2_V_MASK)
/*! @} */

/*! @name PSRTAGETR - Pre-Standard RTAG EtherType register */
/*! @{ */

#define NETC_SW_ENETC_PSRTAGETR_ETHERTYPE_MASK   (0xFFFFU)
#define NETC_SW_ENETC_PSRTAGETR_ETHERTYPE_SHIFT  (0U)
#define NETC_SW_ENETC_PSRTAGETR_ETHERTYPE(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_PSRTAGETR_ETHERTYPE_SHIFT)) & NETC_SW_ENETC_PSRTAGETR_ETHERTYPE_MASK)
/*! @} */

/*! @name DOSL2CR - DoS L2 configuration register */
/*! @{ */

#define NETC_SW_ENETC_DOSL2CR_SAMEADDR_MASK      (0x1U)
#define NETC_SW_ENETC_DOSL2CR_SAMEADDR_SHIFT     (0U)
#define NETC_SW_ENETC_DOSL2CR_SAMEADDR(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_DOSL2CR_SAMEADDR_SHIFT)) & NETC_SW_ENETC_DOSL2CR_SAMEADDR_MASK)

#define NETC_SW_ENETC_DOSL2CR_MSAMCC_MASK        (0x2U)
#define NETC_SW_ENETC_DOSL2CR_MSAMCC_SHIFT       (1U)
#define NETC_SW_ENETC_DOSL2CR_MSAMCC(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_DOSL2CR_MSAMCC_SHIFT)) & NETC_SW_ENETC_DOSL2CR_MSAMCC_MASK)
/*! @} */

/*! @name VLANIPVMPR0 - VLAN to IPV mapping profile 0 register 0..VLAN to IPV mapping profile 1 register 0 */
/*! @{ */

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_0_MASK (0x7U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_0_SHIFT (0U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_0(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_0_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_0_MASK)

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_1_MASK (0x70U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_1_SHIFT (4U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_1(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_1_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_1_MASK)

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_2_MASK (0x700U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_2_SHIFT (8U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_2(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_2_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_2_MASK)

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_3_MASK (0x7000U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_3_SHIFT (12U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_3(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_3_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_3_MASK)

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_4_MASK (0x70000U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_4_SHIFT (16U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_4(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_4_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_4_MASK)

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_5_MASK (0x700000U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_5_SHIFT (20U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_5(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_5_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_5_MASK)

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_6_MASK (0x7000000U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_6_SHIFT (24U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_6(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_6_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_6_MASK)

#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_7_MASK (0x70000000U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_7_SHIFT (28U)
#define NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_7(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_7_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_7_MASK)
/*! @} */

/* The count of NETC_SW_ENETC_VLANIPVMPR0 */
#define NETC_SW_ENETC_VLANIPVMPR0_COUNT          (2U)

