Masmiseim36/nxpSDK/devices/MIMXRT1187/periph/PERI_NETC_SW_ENETC.h
/*! @name ISCITCAPR - Ingress stream counter index table capability register */
/*! @{ */

#define NETC_SW_ENETC_ISCITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_ENETC_ISCITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ISCITCAPR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISCITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ISCITCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_ISCITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ISCITCAPR_ACCESS_METH(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ISCITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ISCITMAR - Ingress stream counter index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_ISCITMAR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_ISCITMAR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_ENETC_ISCITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_ISCITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISCITOR - Ingress stream counter index table operational register */
/*! @{ */

#define NETC_SW_ENETC_ISCITOR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_ENETC_ISCITOR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_ENETC_ISCITOR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISCITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ISCAPR - Ingress stream capability register */
/*! @{ */

#define NETC_SW_ENETC_ISCAPR_ISQG_MASK           (0x2U)
#define NETC_SW_ENETC_ISCAPR_ISQG_SHIFT          (1U)
#define NETC_SW_ENETC_ISCAPR_ISQG(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCAPR_ISQG_SHIFT)) & NETC_SW_ENETC_ISCAPR_ISQG_MASK)

#define NETC_SW_ENETC_ISCAPR_SG_MASK             (0x8U)
#define NETC_SW_ENETC_ISCAPR_SG_SHIFT            (3U)
#define NETC_SW_ENETC_ISCAPR_SG(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCAPR_SG_SHIFT)) & NETC_SW_ENETC_ISCAPR_SG_MASK)

#define NETC_SW_ENETC_ISCAPR_RP_MASK             (0x10U)
#define NETC_SW_ENETC_ISCAPR_RP_SHIFT            (4U)
#define NETC_SW_ENETC_ISCAPR_RP(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCAPR_RP_SHIFT)) & NETC_SW_ENETC_ISCAPR_RP_MASK)

#define NETC_SW_ENETC_ISCAPR_MAXSDU_MASK         (0x20U)
#define NETC_SW_ENETC_ISCAPR_MAXSDU_SHIFT        (5U)
#define NETC_SW_ENETC_ISCAPR_MAXSDU(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCAPR_MAXSDU_SHIFT)) & NETC_SW_ENETC_ISCAPR_MAXSDU_MASK)

#define NETC_SW_ENETC_ISCAPR_FWD_MASK            (0x200U)
#define NETC_SW_ENETC_ISCAPR_FWD_SHIFT           (9U)
#define NETC_SW_ENETC_ISCAPR_FWD(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCAPR_FWD_SHIFT)) & NETC_SW_ENETC_ISCAPR_FWD_MASK)

#define NETC_SW_ENETC_ISCAPR_ET_MASK             (0x400U)
#define NETC_SW_ENETC_ISCAPR_ET_SHIFT            (10U)
#define NETC_SW_ENETC_ISCAPR_ET(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISCAPR_ET_SHIFT)) & NETC_SW_ENETC_ISCAPR_ET_MASK)
/*! @} */

/*! @name ISITCAPR - Ingress stream index table capability register */
/*! @{ */

#define NETC_SW_ENETC_ISITCAPR_NUM_ENTRIES_MASK  (0xFFFFU)
#define NETC_SW_ENETC_ISITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ISITCAPR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ISITCAPR_ACCESS_METH_MASK  (0xF00000U)
#define NETC_SW_ENETC_ISITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ISITCAPR_ACCESS_METH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ISITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ISITMAR - Ingress stream index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_ISITMAR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_ISITMAR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_ISITMAR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_ISITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISITOR - Ingress stream index table operational register */
/*! @{ */

#define NETC_SW_ENETC_ISITOR_NUM_ENTRIES_MASK    (0xFFFFU)
#define NETC_SW_ENETC_ISITOR_NUM_ENTRIES_SHIFT   (0U)
#define NETC_SW_ENETC_ISITOR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ISQGITCAPR - Ingress sequence generation index table capability register */
/*! @{ */

#define NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ISQGITCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_ISQGITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ISQGITCAPR_ACCESS_METH(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISQGITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ISQGITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ISQGITMAR - Ingress sequence generation index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_ISQGITMAR_NUM_WORDS_MASK   (0x1FFFU)
#define NETC_SW_ENETC_ISQGITMAR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_ENETC_ISQGITMAR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISQGITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_ISQGITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISQGITOR - Ingress sequence generation index table operational register */
/*! @{ */

#define NETC_SW_ENETC_ISQGITOR_NUM_ENTRIES_MASK  (0xFFFFU)
#define NETC_SW_ENETC_ISQGITOR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ISQGITOR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISQGITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISQGITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name SGCAPR - Stream gate capability register */
/*! @{ */

#define NETC_SW_ENETC_SGCAPR_GLC_AO_MASK         (0x1U)
#define NETC_SW_ENETC_SGCAPR_GLC_AO_SHIFT        (0U)
#define NETC_SW_ENETC_SGCAPR_GLC_AO(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_AO_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_AO_MASK)

#define NETC_SW_ENETC_SGCAPR_GLC_GC_MASK         (0x2U)
#define NETC_SW_ENETC_SGCAPR_GLC_GC_SHIFT        (1U)
#define NETC_SW_ENETC_SGCAPR_GLC_GC(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_GC_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_GC_MASK)

#define NETC_SW_ENETC_SGCAPR_GLC_IO_MASK         (0x4U)
#define NETC_SW_ENETC_SGCAPR_GLC_IO_SHIFT        (2U)
#define NETC_SW_ENETC_SGCAPR_GLC_IO(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_IO_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_IO_MASK)

