Masmiseim36/nxpSDK/devices/MIMXRT1187/periph/PERI_NETC_SW_ENETC.h
#define NETC_SW_ENETC_ISIDKC3CR0_OVIDP_MASK      (0x20U)
#define NETC_SW_ENETC_ISIDKC3CR0_OVIDP_SHIFT     (5U)
/*! OVIDP - Outer VID Present
 *  0b0..Outer VLAN ID is not present in the key
 *  0b1..Outer VLAN ID is present in the key
 */
#define NETC_SW_ENETC_ISIDKC3CR0_OVIDP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3CR0_OVIDP_SHIFT)) & NETC_SW_ENETC_ISIDKC3CR0_OVIDP_MASK)

#define NETC_SW_ENETC_ISIDKC3CR0_OPCPP_MASK      (0x40U)
#define NETC_SW_ENETC_ISIDKC3CR0_OPCPP_SHIFT     (6U)
/*! OPCPP - Outer PCP Present
 *  0b0..Outer VLAN header's PCP field not present in the key
 *  0b1..Outer VLAN header's PCP field present in the key
 */
#define NETC_SW_ENETC_ISIDKC3CR0_OPCPP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3CR0_OPCPP_SHIFT)) & NETC_SW_ENETC_ISIDKC3CR0_OPCPP_MASK)

#define NETC_SW_ENETC_ISIDKC3CR0_IVIDP_MASK      (0x80U)
#define NETC_SW_ENETC_ISIDKC3CR0_IVIDP_SHIFT     (7U)
/*! IVIDP - Inner VID Present.
 *  0b0..Inner VLAN ID is not present in the key
 *  0b1..Inner VLAN ID is present in the key
 */
#define NETC_SW_ENETC_ISIDKC3CR0_IVIDP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3CR0_IVIDP_SHIFT)) & NETC_SW_ENETC_ISIDKC3CR0_IVIDP_MASK)

#define NETC_SW_ENETC_ISIDKC3CR0_IPCPP_MASK      (0x100U)
#define NETC_SW_ENETC_ISIDKC3CR0_IPCPP_SHIFT     (8U)
/*! IPCPP - Inner PCP Present
 *  0b0..Inner PCP is not present in the key
 *  0b1..Inner PCP is present in the key
 */
#define NETC_SW_ENETC_ISIDKC3CR0_IPCPP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3CR0_IPCPP_SHIFT)) & NETC_SW_ENETC_ISIDKC3CR0_IPCPP_MASK)

#define NETC_SW_ENETC_ISIDKC3CR0_SQTP_MASK       (0x200U)
#define NETC_SW_ENETC_ISIDKC3CR0_SQTP_SHIFT      (9U)
/*! SQTP - Sequence Tag (code point) Present.
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC3CR0_SQTP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3CR0_SQTP_SHIFT)) & NETC_SW_ENETC_ISIDKC3CR0_SQTP_MASK)

#define NETC_SW_ENETC_ISIDKC3CR0_ETP_MASK        (0x400U)
#define NETC_SW_ENETC_ISIDKC3CR0_ETP_SHIFT       (10U)
/*! ETP - EtherType Present.
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC3CR0_ETP(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3CR0_ETP_SHIFT)) & NETC_SW_ENETC_ISIDKC3CR0_ETP_MASK)
/*! @} */

/*! @name ISIDKC3PF0CR - Ingress stream identification key construction 3 payload field 0 configuration register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC3PF0CR_PFP_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_PFP_SHIFT     (0U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_PFP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF0CR_PFP_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF0CR_PFP_MASK)

#define NETC_SW_ENETC_ISIDKC3PF0CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_ENETC_ISIDKC3PF0CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_NUM_BYTES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF0CR_NUM_BYTES_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF0CR_NUM_BYTES_MASK)

#define NETC_SW_ENETC_ISIDKC3PF0CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF0CR_BYTE_OFFSET_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF0CR_BYTE_OFFSET_MASK)

#define NETC_SW_ENETC_ISIDKC3PF0CR_FBMASK_MASK   (0x70000U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_FBMASK_SHIFT  (16U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_FBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF0CR_FBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF0CR_FBMASK_MASK)

#define NETC_SW_ENETC_ISIDKC3PF0CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC3PF0CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF0CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF0CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC3PF1CR - Ingress stream identification key construction 3 payload field 1 configuration register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC3PF1CR_PFP_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_PFP_SHIFT     (0U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_PFP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF1CR_PFP_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF1CR_PFP_MASK)

#define NETC_SW_ENETC_ISIDKC3PF1CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_ENETC_ISIDKC3PF1CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_NUM_BYTES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF1CR_NUM_BYTES_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF1CR_NUM_BYTES_MASK)

#define NETC_SW_ENETC_ISIDKC3PF1CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF1CR_BYTE_OFFSET_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF1CR_BYTE_OFFSET_MASK)

#define NETC_SW_ENETC_ISIDKC3PF1CR_FBMASK_MASK   (0x70000U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_FBMASK_SHIFT  (16U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_FBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF1CR_FBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF1CR_FBMASK_MASK)

#define NETC_SW_ENETC_ISIDKC3PF1CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC3PF1CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF1CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF1CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC3PF2CR - Ingress stream identification key construction 3 payload field 2 configuration register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC3PF2CR_PFP_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_PFP_SHIFT     (0U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_PFP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF2CR_PFP_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF2CR_PFP_MASK)

#define NETC_SW_ENETC_ISIDKC3PF2CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_ENETC_ISIDKC3PF2CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_NUM_BYTES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF2CR_NUM_BYTES_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF2CR_NUM_BYTES_MASK)

#define NETC_SW_ENETC_ISIDKC3PF2CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF2CR_BYTE_OFFSET_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF2CR_BYTE_OFFSET_MASK)

#define NETC_SW_ENETC_ISIDKC3PF2CR_FBMASK_MASK   (0x70000U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_FBMASK_SHIFT  (16U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_FBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF2CR_FBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF2CR_FBMASK_MASK)

#define NETC_SW_ENETC_ISIDKC3PF2CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC3PF2CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF2CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF2CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC3PF3CR - Ingress stream identification key construction 3 payload field 3 configuration register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC3PF3CR_PFP_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_PFP_SHIFT     (0U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_PFP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF3CR_PFP_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF3CR_PFP_MASK)

#define NETC_SW_ENETC_ISIDKC3PF3CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_ENETC_ISIDKC3PF3CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_NUM_BYTES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF3CR_NUM_BYTES_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF3CR_NUM_BYTES_MASK)

#define NETC_SW_ENETC_ISIDKC3PF3CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF3CR_BYTE_OFFSET_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF3CR_BYTE_OFFSET_MASK)

#define NETC_SW_ENETC_ISIDKC3PF3CR_FBMASK_MASK   (0x70000U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_FBMASK_SHIFT  (16U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_FBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF3CR_FBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF3CR_FBMASK_MASK)

#define NETC_SW_ENETC_ISIDKC3PF3CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC3PF3CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC3PF3CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC3PF3CR_LBMASK_MASK)
/*! @} */

/*! @name ISFHTCAPR - Ingress stream filter hash table capability register */
/*! @{ */

#define NETC_SW_ENETC_ISFHTCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_ISFHTCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ISFHTCAPR_ACCESS_METH(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISFHTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ISFHTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ISFHTOR - Ingress stream filter hash table operational register */
/*! @{ */

#define NETC_SW_ENETC_ISFHTOR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_ENETC_ISFHTOR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_ENETC_ISFHTOR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISFHTOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISFHTOR_NUM_ENTRIES_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group NETC_SW_ENETC_Register_Masks */


/*!
 * @}
 */ /* end of group NETC_SW_ENETC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_NETC_SW_ENETC_H_ */

